const quest = [
  {
    text: "Дирекційний кут - це кут між вертикальною лінією координатної сітки карти та напрямком на орієнтир, який відраховується...",
    options: [
      { id: 0, text: "Проти ходу годинникової стрілки", isCorrect: false },
      { id: 1, text: "За ходом годинникової стрілки", isCorrect: true },
      { id: 2, text: "По Сонцю", isCorrect: false },
    ],
  },
  {
    text: "Кутомір відраховується від...",
    options: [
      { id: 0, text: "Осі каналу ствола", isCorrect: false },
      { id: 1, text: "Зворотнього напрямку осі каналу ствола", isCorrect: true },
      { id: 2, text: "Напрямку на північ", isCorrect: false },
    ],
  },
  {
    text: "В якому напрямку відраховують кутомір?",
    options: [
      { id: 0, text: "Проти ходу годинникової стрілки", isCorrect: true },
      { id: 1, text: "За ходом годинниковою стрілкою", isCorrect: false },
      { id: 2, text: "По сонцю", isCorrect: false },
    ],
  },
  {
    text: "Кутомір – це горизонтальний кут у точці стояння гармати, який відраховується проти ходу годинникової стрілки від зворотного напрямку осі каналу ствола наведеної гармати до ...",
    options: [
      { id: 0, text: "напрямку на орієнтир", isCorrect: false },
      { id: 1, text: "напрямку на північ", isCorrect: false },
      { id: 2, text: "напрямку на точку наведення", isCorrect: true },
      
    ],
  },
  {
    text: "Точкою наведення називають нерухомий, чітко виражений предмет...",
    options: [
      { id: 0, text: "який не має чітких контурів", isCorrect: false },
      { id: 1, text: "який розташований якомога далі і має чіткі вертикальні контури", isCorrect: true },
      { id: 2, text: "який розташований на висоті", isCorrect: true },
      
    ],
  },
]

export default quest