const quest = [
  {
    text: "Дирекційний кут - це кут між вертикальною лінією координатної сітки карти та напрямком на орієнтир, який відраховується...",
    options: [
      { id: 0, text: "Проти ходу годинникової стрілки", isCorrect: false },
      { id: 1, text: "За ходом годинникової стрілки", isCorrect: true },
      { id: 2, text: "По Сонцю", isCorrect: false },
    ],
    
  },
  {
    text: "Кутомір відраховується від...",
    options: [
      { id: 0, text: "Осі каналу ствола", isCorrect: false },
      { id: 1, text: "Зворотнього напрямку осі каналу ствола", isCorrect: true },
      { id: 2, text: "Напрямку на північ", isCorrect: false },
    ],
  },
  {
    text: "В якому напрямку відраховують кутомір?",
    options: [
      { id: 0, text: "Проти ходу годинникової стрілки", isCorrect: true },
      { id: 1, text: "За ходом годинниковою стрілкою", isCorrect: false },
      { id: 2, text: "По сонцю", isCorrect: false },
    ],
  },
  {
    text: "Кутомір – це горизонтальний кут у точці стояння гармати, який відраховується проти ходу годинникової стрілки від зворотного напрямку осі каналу ствола наведеної гармати до ...",
    options: [
      { id: 0, text: "напрямку на орієнтир", isCorrect: false },
      { id: 1, text: "напрямку на північ", isCorrect: false },
      { id: 2, text: "напрямку на точку наведення", isCorrect: true },
      
    ],
  },
  {
    text: "Точкою наведення називають нерухомий, чітко виражений предмет...",
    options: [
      { id: 0, text: "який не має чітких контурів", isCorrect: false },
      { id: 1, text: "який розташований якомога далі і має чіткі вертикальні контури", isCorrect: true },
      { id: 2, text: "який розташований на висоті", isCorrect: true },
      
    ],
  },
  {
    text: "Відмічання - це визначення установок прицільних пристроїв, що відповідають положенню ствола наведеної гармати. Відмічання проводять за допомогою ...",
    options: [
      { id: 0, text: "прицільних пристроїв", isCorrect: true },
      { id: 1, text: "підйомного та поворотного механізмів", isCorrect: false },
      { id: 2, text: "квадранта", isCorrect: true },
      
    ],
  },
  {
    text: "Наведення - це надання стволу гармати напрямку на ціль і кута підвищення, що відповідають дальності стрільби до цілі. Наведення здійснюють за допомогою ...",
    options: [
      { id: 0, text: "бусолі", isCorrect: false },
      { id: 1, text: "точки наведення", isCorrect: false },
      { id: 2, text: "прицільних пристроїв і підйомного та поворотного механізмів", isCorrect: true },
      
    ],
  },
  {
    text: "Основний кутомір гармати - це кутомір гармати, що наведена ...",
    options: [
      { id: 0, text: "на північ", isCorrect: false },
      { id: 1, text: "в основний напрямок стрільби", isCorrect: true },
      { id: 2, text: "в 30-00", isCorrect: false },
      
    ],
  },
  {
      text: "Вихідною (початковою) установкою для наведення гармати в ціль за вирахуваним доворотом є ...",
      options: [
        { id: 0, text: "основний кутомір гармати", isCorrect: true },
        { id: 1, text: "дирекційний кут на ціль", isCorrect: false },
        { id: 2, text: "кутомір на бусоль", isCorrect: false },
        
      ],
   },
   {
      text: "Найменший приціл - це приціл, що відповідає найменшому куту підвищення, для даного заряду, при стрільбі на якому ...",
      options: [
        { id: 0, text: "гармата буде найменш помітна", isCorrect: false },
        { id: 1, text: "снаряди будуть перелітати через гребінь укриття", isCorrect: true },
        { id: 2, text: "буде забезпечуватись найбільша точність", isCorrect: false },
        
      ],
   },
]

export default quest