const quest = [
  {
    text: "З яких основних частин складається причіпна гармата?",
    options: [
      { id: 0, text: "нижній станок та люлька", isCorrect: false },
      { id: 1, text: "ствол з затвором та лафет", isCorrect: true },
      { id: 2, text: "накатник та гальмо відкату", isCorrect: false },
    ],
    
  },
  {
    text: "Ствол є основою частиною гармати і призначений ...",
    options: [
      { id: 0, text: "для відведення порохових газів", isCorrect: false },
      { id: 1, text: "для наведення гармати", isCorrect: false },
      { id: 2, text: "для надання снаряду напрямку руху та необхідної початкової швидкості", isCorrect: true },
    ],
    
  },
  {
    text: "Дульне гальмо призначене для ...",
    options: [
      { id: 0, text: "зменшення дії пострілу на лафет гармати", isCorrect: true },
      { id: 1, text: "прискорення снаряду", isCorrect: false },
      { id: 2, text: "сповільнення снаряду", isCorrect: false },
    ],
    
  },
  {
    text: "Казенник (казенна частина) це ...",
    options: [
      { id: 0, text: "частина лафету", isCorrect: false },
      { id: 1, text: "механізм наведення", isCorrect: false },
      { id: 2, text: "частина ствола, призначена для розміщення деталей затвора", isCorrect: true },
    ],
    
  },
  {
    text: "Основні функції затвора - це ...",
    options: [
      { id: 0, text: "замикання, відмикання, здійснення пострілу, екстракція гільзи", isCorrect: true },
      { id: 1, text: "поворот ствола, підйом ствола", isCorrect: false },
      { id: 2, text: "врівноваження ствола, зменшення дії пострілу на лафет", isCorrect: false },
    ],
    
  },
  {
    text: "Люлька призначена для ...",
    options: [
      { id: 0, text: "врівноваження підйомної частини гармати", isCorrect: false },
      { id: 1, text: "опори ствола, спрямування його руху під час відкату та накату, повороту ствола при наведенні", isCorrect: true },
      { id: 2, text: "для надання стволу кутів горизонтального наведення", isCorrect: false },
    ],
    
  },
  {
    text: "Противідкатні пристрої (ПВП) - це частина лафету гармати, що призначена для ...",
    options: [
      { id: 0, text: "жорсткого з’єднання ствола і лафета", isCorrect: false },
      { id: 1, text: "забезпечення необхідної швидкості та напрямку снаряду при пострілі", isCorrect: false },
      { id: 2, text: "пружного з’єднання лафету та ствола, гальмування відкатних частин, повернення їх у початкове положення", isCorrect: true },
    ],
    
  },
  {
    text: "До противідкатних пристроїв (ПВП) входять ...",
    options: [
      { id: 0, text: "гальмо відкату та гальмо накату (гальмо відкатних частин), накатник", isCorrect: true },
      { id: 1, text: "врівноважуючий механізм, поворотний механізм, підйомний механізм", isCorrect: false },
      { id: 2, text: "верхній станок, нижній станок, люлька", isCorrect: false },
    ],
    
  },
  {
    text: "Гальмо відкатних частин це частина противідкатних пристроїв, яка забезпечує ...",
    options: [
      { id: 0, text: "повернення відкатних частин у початкове положення", isCorrect: false },
      { id: 1, text: "гальмування під час відкату та накату ствола при пострілі", isCorrect: true },
      { id: 2, text: "плавний підйом та опускання ствола", isCorrect: false },
    ],
    
  },
  {
    text: "Накатник - це частина противідкатних пристроїв (ПВП), яка призначена для ...",
    options: [
      { id: 0, text: "сповільнення відкату ствола при пострілі", isCorrect: false },
      { id: 1, text: "забезпечення плавного підйому та опускання ствола", isCorrect: false },
      { id: 2, text: "повернення відкатних частин у початкове положення та утримання їх у цьому положенні за будь-якого кута підвищення ствола", isCorrect: true },
    ],
    
  },
  {
    text: "За типом пружного тіла накатники поділяються на ...",
    options: [
      { id: 0, text: "пружинні і пневматичні", isCorrect: true },
      { id: 1, text: "одноциліндрові і багатоциліндрові", isCorrect: false },
      { id: 2, text: "Закриті і відкриті", isCorrect: false },
    ],
    
  },
  {
    text: "Врівноважуючий механізм призначений для ...",
    options: [
      { id: 0, text: "гальмування відкатних частин", isCorrect: false},
      { id: 1, text: "розвантаження приводу вертикального наведення", isCorrect: true },
      { id: 2, text: "повернення ствола у початкове положення після пострілу", isCorrect: false },
    ],
    
  },
  {
    text: "Механізми наведення за призначенням поділяються на ...",
    options: [
      { id: 0, text: "ручні і автоматичні", isCorrect: false},
      { id: 1, text: "пневматичні та гідравлічні", isCorrect: false },
      { id: 2, text: "вертикального наведення та горизонтального наведення", isCorrect: true },
    ],
    
  },
  {
    text: "Нижній станок зі станинами призначений ...",
    options: [
      { id: 0, text: "для опори поворотної частини та забезпечення стійкості гармати під час пострілу", isCorrect: true},
      { id: 1, text: "повороту гармати", isCorrect: false },
      { id: 2, text: "підйому гармати", isCorrect: false },
    ],
    
  },
  {
    text: "Ходова частина - це ...",
    options: [
      { id: 0, text: "частина люльки", isCorrect: false },
      { id: 1, text: "частина нижнього станка, що служить для транспортування гармати", isCorrect: true },
      { id: 2, text: "частина ствольно-затворної групи", isCorrect: false },
    ],
  },
  {
    text: "Які вузли відсутні на схемі?",
    options: [
      { id: 0, text: "панорама, колеса, станини", isCorrect: false },
      { id: 1, text: "дульне гальмо, сошник, коліматор", isCorrect: false },
      { id: 2, text: "гальмо відкату, прицільні пристрої, верхній станок", isCorrect: true },
    ],
    qImg: '/images/quiz-img/art-constr-1.jpg'
  },
  
  
]

export default quest